<template>
    <main>
        <h1>Пользовательское соглашение</h1>
        <p>Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем xdice.sbs (далее XDICE или Администрация) с одной стороны и пользователем сайта с другой.
            Сайт XDICE не является средством массовой информации.<br><br>
            Используя сайт, Вы соглашаетесь с условиями данного соглашения.
            Если Вы не согласны с условиями данного соглашения, не используйте сайт XDICE!</p>

        <h2>Права и обязанности сторон</h2>

        <h3>Пользователь имеет право:</h3>
        - использовать информацию, и функционал сайта

        <h3>Администрация имеет право:</h3>
        <p>
            - по своему усмотрению и необходимости создавать, изменять, отменять правила<br>
            - ограничивать доступ к любой информации на сайте<br>
            - создавать, изменять, удалять информацию<br>
            - удалять учетные записи<br>
            - отказывать в регистрации без объяснения причин
        </p>

        <h3>Пользователь обязуется:</h3>
        <p>
            - не проводить регестрацю если пользователю не исполнилось 18 лет!!!<br>
            - не приобретать игровые токены XDE на последние, семейные, или заемные средства!!!<br>
            - играть ответственно, так как XDICE это азартная игра!!!<br>
            - не нарушать работоспособность сайта<br>
            - не совершать действия, направленные на введение других Пользователей в заблуждение<br>
            - не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами
        </p>
        <h3>Администрация обязуется:</h3>
        <p>
            - проводить честную игру на основе рандомного генератора чисел, где результат будет зависить исключительно от везения игрока!<br>
            - поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.<br>
            - осуществлять разностороннюю защиту учетной записи Пользователя<br>
        </p>
        <h2>Ответственность сторон</h2>
        <p>
            - пользователь лично несет полную ответственность за распространяемую им информацию<br>
            - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами<br>
            - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса<br>
        </p>
        <h2>Условия действия Соглашения</h2>

        <p>Данное Соглашение вступает в силу при любом использовании данного сайта.
        Соглашение перестает действовать при появлении его новой версии.
        Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
        Администрация не оповещает пользователей об изменении в Соглашении.</p>
    </main>
</template>

<style lang="scss" scoped>
    main{
        max-width: 1000px;
        width: 95%;
        margin: 0 auto;
    }

    h1{
        font-weight: 700;
        font-size: 35px;
        line-height: 41px; 
        color: #000000;
        margin-top: 26px;
        margin-bottom: 10px;
    }

    h2{
        font-weight: 500;
        font-size: 25px;
        line-height: 30px;  
        color: #000000;
        margin: 20px 0;
    }

    h3{
        font-weight: 500;
        font-size: 20px;
        line-height: 24px;  
        color: #000000;
        margin-top: 15px;
    }

    p{
        font-weight: 400;
        font-size: 16px;
        line-height: 19px;  
        color: #000000;
    }
</style>